In [1]:
import pandas as pd
import pyodbc

In [2]:
server='(local)'
db='students_results'

#create the connection
con=pyodbc.connect('DRIVER={SQL Server};SERVER='+ server +';DATABASE='+ db +';Trusted_Connection=yes')

print(con)

<pyodbc.Connection object at 0x0C5166B0>

In [3]:
#Query of db
sql= 'SELECT * FROM student'

sql_df=pd.read_sql(sql,con)
sql_df

,Name,RollNo,DOB,Telugu,Hindi,English,Maths,Science,Social,PhoneNumber
0,RamaRaju,89920169,2008-08-01,90,69,74,59,65,75,9848951300
1,Ramu,89920168,2006-06-03,92,15,75,56,67,78,9848955301
2,Ajay,89920167,2009-06-03,90,65,76,54,30,79,9848955302
3,Vijay,89920165,2001-06-03,23,44,45,56,77,88,9848955303
4,Sitha,89920161,2004-06-03,92,14,10,56,27,78,9848955304
5,Ramesh,89920178,2003-06-03,42,64,74,26,67,78,9848955305
6,Raju1,89920169,2008-08-01,90,69,74,59,65,75,9848955555

print("Enter a Unique Id")    
Id=int(input())    
print("Enter first Name")    
firstname=input()  
print("Enter last Name")    
LastName=input()  
print("Enter Regno")    
RegisterNo=int(input())   
cursor = connection.cursor()    
SQLCommand = ("INSERT INTO tbl_employee(id,firstName, LastName, EmployeeId) VALUES (?,?,?,?)")    
Values = [Id,firstname,LastName,RegisterNo]   
#Processing Query    
cursor.execute(SQLCommand,Values)     
#Commiting any pending transaction to the database.    
connection.commit()    
#closing connection    
print("Data Successfully Inserted")   
connection.close()

In [9]:
import json
with open('E:/employees.json') as json_file:
    json_data = json.load(json_file)
    print(json_data)

[{'employee': {'firstName': 'Lokesh', 'lastName': 'Gupta', 'website': 'howtodoinjava.com'}}, {'employee': {'firstName': 'Brian', 'lastName': 'Schultz', 'website': 'example.com'}}]

In [15]:
import requests
obj_req=get.requests('https://www.google.com/')
print(obj_req)

NameError: name 'get' is not defined